{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-\u5236\u5ea6\u672f\u8bed",
    "2": "I-\u5236\u5ea6\u672f\u8bed",
    "3": "B-\u5efa\u7b51\u8f7d\u4f53",
    "4": "I-\u5efa\u7b51\u8f7d\u4f53",
    "5": "B-\u901a\u7528\u7eb9\u6837",
    "6": "I-\u901a\u7528\u7eb9\u6837",
    "7": "B-\u70b9\u7f00\u7eb9\u6837",
    "8": "I-\u70b9\u7f00\u7eb9\u6837",
    "9": "B-\u9002\u5408\u7eb9\u6837",
    "10": "I-\u9002\u5408\u7eb9\u6837",
    "11": "B-\u9752\u8272\u7c7b",
    "12": "I-\u9752\u8272\u7c7b",
    "13": "B-\u7eff\u8272\u7c7b",
    "14": "I-\u7eff\u8272\u7c7b",
    "15": "B-\u7ea2\u8272\u7c7b",
    "16": "I-\u7ea2\u8272\u7c7b",
    "17": "B-\u7d2b\u8272\u7c7b",
    "18": "I-\u7d2b\u8272\u7c7b",
    "19": "B-\u9ed1\u8272\u7c7b",
    "20": "I-\u9ed1\u8272\u7c7b",
    "21": "B-\u767d\u8272\u7c7b",
    "22": "I-\u767d\u8272\u7c7b",
    "23": "B-\u9ec4\u8272\u7c7b",
    "24": "I-\u9ec4\u8272\u7c7b",
    "25": "B-\u91d1\u8272\u7c7b",
    "26": "I-\u91d1\u8272\u7c7b",
    "27": "B-\u77ff\u7269\u989c\u6599",
    "28": "I-\u77ff\u7269\u989c\u6599",
    "29": "B-\u690d\u7269\u989c\u6599",
    "30": "I-\u690d\u7269\u989c\u6599",
    "31": "B-\u52a0\u5de5\u8f85\u6599",
    "32": "I-\u52a0\u5de5\u8f85\u6599",
    "33": "B-\u57fa\u5c42\u5904\u7406\u5de5\u827a",
    "34": "I-\u57fa\u5c42\u5904\u7406\u5de5\u827a",
    "35": "B-\u989c\u6599\u5236\u5907\u5de5\u827a",
    "36": "I-\u989c\u6599\u5236\u5907\u5de5\u827a",
    "37": "B-\u8d77\u7a3f\u4e0e\u52fe\u52d2\u5de5\u827a",
    "38": "I-\u8d77\u7a3f\u4e0e\u52fe\u52d2\u5de5\u827a",
    "39": "B-\u7740\u8272\u4e0e\u6e32\u67d3\u5de5\u827a",
    "40": "I-\u7740\u8272\u4e0e\u6e32\u67d3\u5de5\u827a",
    "41": "B-\u7eb9\u6837\u7ed8\u5236\u5de5\u827a",
    "42": "I-\u7eb9\u6837\u7ed8\u5236\u5de5\u827a",
    "43": "B-\u8d34\u91d1\u4e0e\u88c5\u9970\u5de5\u827a",
    "44": "I-\u8d34\u91d1\u4e0e\u88c5\u9970\u5de5\u827a",
    "45": "B-\u7ed8\u5236\u5de5\u5177",
    "46": "I-\u7ed8\u5236\u5de5\u5177",
    "47": "B-\u52a0\u5de5\u5de5\u5177",
    "48": "I-\u52a0\u5de5\u5de5\u5177",
    "49": "B-\u89c4\u5219/\u7ea6\u675f",
    "50": "I-\u89c4\u5219/\u7ea6\u675f"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-\u5236\u5ea6\u672f\u8bed": 1,
    "B-\u52a0\u5de5\u5de5\u5177": 47,
    "B-\u52a0\u5de5\u8f85\u6599": 31,
    "B-\u57fa\u5c42\u5904\u7406\u5de5\u827a": 33,
    "B-\u5efa\u7b51\u8f7d\u4f53": 3,
    "B-\u690d\u7269\u989c\u6599": 29,
    "B-\u70b9\u7f00\u7eb9\u6837": 7,
    "B-\u767d\u8272\u7c7b": 21,
    "B-\u7740\u8272\u4e0e\u6e32\u67d3\u5de5\u827a": 39,
    "B-\u77ff\u7269\u989c\u6599": 27,
    "B-\u7d2b\u8272\u7c7b": 17,
    "B-\u7ea2\u8272\u7c7b": 15,
    "B-\u7eb9\u6837\u7ed8\u5236\u5de5\u827a": 41,
    "B-\u7ed8\u5236\u5de5\u5177": 45,
    "B-\u7eff\u8272\u7c7b": 13,
    "B-\u89c4\u5219/\u7ea6\u675f": 49,
    "B-\u8d34\u91d1\u4e0e\u88c5\u9970\u5de5\u827a": 43,
    "B-\u8d77\u7a3f\u4e0e\u52fe\u52d2\u5de5\u827a": 37,
    "B-\u9002\u5408\u7eb9\u6837": 9,
    "B-\u901a\u7528\u7eb9\u6837": 5,
    "B-\u91d1\u8272\u7c7b": 25,
    "B-\u9752\u8272\u7c7b": 11,
    "B-\u989c\u6599\u5236\u5907\u5de5\u827a": 35,
    "B-\u9ec4\u8272\u7c7b": 23,
    "B-\u9ed1\u8272\u7c7b": 19,
    "I-\u5236\u5ea6\u672f\u8bed": 2,
    "I-\u52a0\u5de5\u5de5\u5177": 48,
    "I-\u52a0\u5de5\u8f85\u6599": 32,
    "I-\u57fa\u5c42\u5904\u7406\u5de5\u827a": 34,
    "I-\u5efa\u7b51\u8f7d\u4f53": 4,
    "I-\u690d\u7269\u989c\u6599": 30,
    "I-\u70b9\u7f00\u7eb9\u6837": 8,
    "I-\u767d\u8272\u7c7b": 22,
    "I-\u7740\u8272\u4e0e\u6e32\u67d3\u5de5\u827a": 40,
    "I-\u77ff\u7269\u989c\u6599": 28,
    "I-\u7d2b\u8272\u7c7b": 18,
    "I-\u7ea2\u8272\u7c7b": 16,
    "I-\u7eb9\u6837\u7ed8\u5236\u5de5\u827a": 42,
    "I-\u7ed8\u5236\u5de5\u5177": 46,
    "I-\u7eff\u8272\u7c7b": 14,
    "I-\u89c4\u5219/\u7ea6\u675f": 50,
    "I-\u8d34\u91d1\u4e0e\u88c5\u9970\u5de5\u827a": 44,
    "I-\u8d77\u7a3f\u4e0e\u52fe\u52d2\u5de5\u827a": 38,
    "I-\u9002\u5408\u7eb9\u6837": 10,
    "I-\u901a\u7528\u7eb9\u6837": 6,
    "I-\u91d1\u8272\u7c7b": 26,
    "I-\u9752\u8272\u7c7b": 12,
    "I-\u989c\u6599\u5236\u5907\u5de5\u827a": 36,
    "I-\u9ec4\u8272\u7c7b": 24,
    "I-\u9ed1\u8272\u7c7b": 20,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.50.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 21128
}
